---
type: Generic
namespace: Autodesk.Revit.DB.Visual
version: 2024
members: 19
tags: [revit-api, class]
---

# Generic

`Autodesk.Revit.DB.Visual.Generic` · Revit 2024 · 19 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | ColorByObject | 2018.1 | `public static string ColorByObject { get ; }` |
| Property | CommonTintColor | 2018.1 | `public static string CommonTintColor { get ; }` |
| Property | CommonTintToggle | 2018.1 | `public static string CommonTintToggle { get ; }` |
| Property | GenericBumpAmount | 2018.1 | `public static string GenericBumpAmount { get ; }` |
| Property | GenericBumpMap | 2018.1 | `public static string GenericBumpMap { get ; }` |
| Property | GenericCutoutOpacity | 2018.1 | `public static string GenericCutoutOpacity { get ; }` |
| Property | GenericDiffuse | 2018.1 | `public static string GenericDiffuse { get ; }` |
| Property | GenericDiffuseImageFade | 2018.1 | `public static string GenericDiffuseImageFade { get ; }` |
| Property | GenericGlossiness | 2018.1 | `public static string GenericGlossiness { get ; }` |
| Property | GenericIsMetal | 2018.1 | `public static string GenericIsMetal { get ; }` |
| Property | GenericReflectivityAt0deg | 2018.1 | `public static string GenericReflectivityAt0deg { get ; }` |
| Property | GenericReflectivityAt90deg | 2018.1 | `public static string GenericReflectivityAt90deg { get ; }` |
| Property | GenericRefractionIndex | 2018.1 | `public static string GenericRefractionIndex { get ; }` |
| Property | GenericRefractionTranslucencyWeight | 2018.1 | `public static string GenericRefractionTranslucencyWeight { get ; }` |
| Property | GenericSelfIllumColorTemperature | 2018.1 | `public static string GenericSelfIllumColorTemperature { get ; }` |
| Property | GenericSelfIllumFilterMap | 2018.1 | `public static string GenericSelfIllumFilterMap { get ; }` |
| Property | GenericSelfIllumLuminance | 2018.1 | `public static string GenericSelfIllumLuminance { get ; }` |
| Property | GenericTransparency | 2018.1 | `public static string GenericTransparency { get ; }` |
| Property | GenericTransparencyImageFade | 2018.1 | `public static string GenericTransparencyImageFade { get ; }` |